; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	thermograph3 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation13 - direction
	GroundStation12 - direction
	GroundStation21 - direction
	GroundStation7 - direction
	Star32 - direction
	GroundStation6 - direction
	Star20 - direction
	Star18 - direction
	GroundStation14 - direction
	GroundStation31 - direction
	Star34 - direction
	Star26 - direction
	Star0 - direction
	GroundStation11 - direction
	Star8 - direction
	Star28 - direction
	Star23 - direction
	Star22 - direction
	GroundStation5 - direction
	Star30 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	Star25 - direction
	GroundStation38 - direction
	Star36 - direction
	Star3 - direction
	Star35 - direction
	GroundStation15 - direction
	Star17 - direction
	GroundStation24 - direction
	Star39 - direction
	Star9 - direction
	Star4 - direction
	Star29 - direction
	GroundStation16 - direction
	Star37 - direction
	Star27 - direction
	GroundStation19 - direction
	GroundStation33 - direction
	Star40 - direction
	Planet41 - direction
	Star42 - direction
	Star43 - direction
	Planet44 - direction
	Planet45 - direction
	Planet46 - direction
	Planet47 - direction
	Phenomenon48 - direction
	Phenomenon49 - direction
	Star50 - direction
	Star51 - direction
	Planet52 - direction
	Planet53 - direction
	Planet54 - direction
	Star55 - direction
	Star56 - direction
	Star57 - direction
	Planet58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Planet61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Star64 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star39)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star32)
	(calibration_target instrument0 GroundStation24)
	(calibration_target instrument0 Star37)
	(calibration_target instrument0 Star27)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star18)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 Star17)
	(supports instrument1 image1)
	(calibration_target instrument1 Star28)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star32)
	(calibration_target instrument1 GroundStation31)
	(calibration_target instrument1 Star20)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation16)
	(calibration_target instrument1 GroundStation21)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star34)
	(calibration_target instrument2 Star20)
	(calibration_target instrument2 Star17)
	(calibration_target instrument2 Star25)
	(supports instrument3 thermograph4)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star18)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 Star20)
	(calibration_target instrument3 Star26)
	(calibration_target instrument3 Star27)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation38)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star26)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star34)
	(calibration_target instrument4 Star29)
	(calibration_target instrument4 GroundStation31)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation14)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation24)
	(calibration_target instrument5 Star28)
	(calibration_target instrument5 GroundStation19)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation24)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation38)
	(calibration_target instrument6 Star22)
	(calibration_target instrument6 Star28)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 Star30)
	(calibration_target instrument6 GroundStation11)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation10)
	(calibration_target instrument7 Star36)
	(calibration_target instrument7 GroundStation24)
	(calibration_target instrument7 Star30)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star25)
	(calibration_target instrument7 Star22)
	(calibration_target instrument7 Star29)
	(calibration_target instrument7 Star23)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 Star36)
	(calibration_target instrument8 Star35)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 GroundStation38)
	(calibration_target instrument8 Star25)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation21)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 Star27)
	(calibration_target instrument9 Star37)
	(calibration_target instrument9 GroundStation16)
	(calibration_target instrument9 Star29)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation33)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 Star39)
	(calibration_target instrument9 GroundStation24)
	(calibration_target instrument9 Star17)
	(calibration_target instrument9 GroundStation15)
	(calibration_target instrument9 Star35)
	(calibration_target instrument9 Star3)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation33)
	(calibration_target instrument10 GroundStation19)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star22)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(pointing satellite1 Star43)
	(pointing satellite2 Star30)
	(pointing satellite3 Star42)
	(have_image Star40 thermograph2)
	(have_image Planet41 thermograph3)
	(have_image Star42 image1)
	(have_image Star43 image1)
	(have_image Planet44 thermograph3)
	(have_image Planet45 thermograph2)
	(have_image Planet46 image1)
	(have_image Planet47 thermograph3)
	(have_image Phenomenon48 thermograph0)
	(have_image Phenomenon49 thermograph2)
	(have_image Star50 thermograph3)
	(have_image Star51 thermograph4)
	(have_image Planet52 image1)
	(have_image Planet53 thermograph2)
	(have_image Planet54 thermograph3)
	(have_image Star55 thermograph0)
	(have_image Star56 thermograph3)
	(have_image Star57 thermograph3)
	(have_image Planet58 thermograph4)
	(have_image Star59 thermograph0)
	(have_image Phenomenon60 thermograph2)
	(have_image Planet61 thermograph2)
	(have_image Phenomenon62 thermograph3)
	(have_image Planet63 thermograph3)
	(have_image Star64 thermograph4)
))

)

; plan
1. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 29
2. (calibrate satellite1 instrument5 groundstation24)
   added: (calibrated instrument5)
   goals met: 0 of 29
3. (switch_on instrument3 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument3)
   goals met: 0 of 29
4. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 29
5. (turn_to satellite3 star42 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 star42)
   goals met: 1 of 29
6. (turn_to satellite2 planet46 groundstation21)
   deleted: (pointing satellite2 groundstation21)
   added: (pointing satellite2 planet46)
   goals met: 1 of 29
7. (turn_to satellite1 phenomenon48 groundstation24)
   deleted: (pointing satellite1 groundstation24)
   added: (pointing satellite1 phenomenon48)
   goals met: 1 of 29
8. (take_image satellite1 phenomenon48 instrument5 thermograph0)
   added: (have_image phenomenon48 thermograph0)
   goals met: 2 of 29
9. (turn_to satellite1 phenomenon49 phenomenon48)
   deleted: (pointing satellite1 phenomenon48)
   added: (pointing satellite1 phenomenon49)
   goals met: 2 of 29
10. (take_image satellite1 phenomenon49 instrument5 thermograph2)
   added: (have_image phenomenon49 thermograph2)
   goals met: 3 of 29
11. (turn_to satellite1 phenomenon60 phenomenon49)
   deleted: (pointing satellite1 phenomenon49)
   added: (pointing satellite1 phenomenon60)
   goals met: 3 of 29
12. (take_image satellite1 phenomenon60 instrument5 thermograph2)
   added: (have_image phenomenon60 thermograph2)
   goals met: 4 of 29
13. (turn_to satellite1 planet45 phenomenon60)
   deleted: (pointing satellite1 phenomenon60)
   added: (pointing satellite1 planet45)
   goals met: 4 of 29
14. (take_image satellite1 planet45 instrument5 thermograph2)
   added: (have_image planet45 thermograph2)
   goals met: 5 of 29
15. (turn_to satellite1 planet53 planet45)
   deleted: (pointing satellite1 planet45)
   added: (pointing satellite1 planet53)
   goals met: 5 of 29
16. (take_image satellite1 planet53 instrument5 thermograph2)
   added: (have_image planet53 thermograph2)
   goals met: 6 of 29
17. (turn_to satellite1 planet58 planet53)
   deleted: (pointing satellite1 planet53)
   added: (pointing satellite1 planet58)
   goals met: 6 of 29
18. (take_image satellite1 planet58 instrument5 thermograph4)
   added: (have_image planet58 thermograph4)
   goals met: 7 of 29
19. (turn_to satellite1 planet61 planet58)
   deleted: (pointing satellite1 planet58)
   added: (pointing satellite1 planet61)
   goals met: 7 of 29
20. (take_image satellite1 planet61 instrument5 thermograph2)
   added: (have_image planet61 thermograph2)
   goals met: 8 of 29
21. (turn_to satellite1 star40 planet61)
   deleted: (pointing satellite1 planet61)
   added: (pointing satellite1 star40)
   goals met: 8 of 29
22. (take_image satellite1 star40 instrument5 thermograph2)
   added: (have_image star40 thermograph2)
   goals met: 9 of 29
23. (turn_to satellite1 star43 star40)
   deleted: (pointing satellite1 star40)
   added: (pointing satellite1 star43)
   goals met: 10 of 29
24. (turn_to satellite0 groundstation7 groundstation38)
   deleted: (pointing satellite0 groundstation38)
   added: (pointing satellite0 groundstation7)
   goals met: 11 of 29
25. (turn_to satellite2 star9 planet46)
   deleted: (pointing satellite2 planet46)
   added: (pointing satellite2 star9)
   goals met: 11 of 29
26. (calibrate satellite2 instrument8 star9)
   added: (calibrated instrument8)
   goals met: 11 of 29
27. (turn_to satellite2 planet46 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet46)
   goals met: 11 of 29
28. (take_image satellite2 planet46 instrument8 image1)
   added: (have_image planet46 image1)
   goals met: 12 of 29
29. (turn_to satellite2 planet52 planet46)
   deleted: (pointing satellite2 planet46)
   added: (pointing satellite2 planet52)
   goals met: 12 of 29
30. (take_image satellite2 planet52 instrument8 image1)
   added: (have_image planet52 image1)
   goals met: 13 of 29
31. (turn_to satellite2 star30 planet52)
   deleted: (pointing satellite2 planet52)
   added: (pointing satellite2 star30)
   goals met: 14 of 29
32. (turn_to satellite2 star42 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star42)
   goals met: 13 of 29
33. (take_image satellite2 star42 instrument8 image1)
   added: (have_image star42 image1)
   goals met: 14 of 29
34. (turn_to satellite2 star30 star42)
   deleted: (pointing satellite2 star42)
   added: (pointing satellite2 star30)
   goals met: 15 of 29
35. (turn_to satellite2 star43 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star43)
   goals met: 14 of 29
36. (take_image satellite2 star43 instrument8 image1)
   added: (have_image star43 image1)
   goals met: 15 of 29
37. (turn_to satellite2 star30 star43)
   deleted: (pointing satellite2 star43)
   added: (pointing satellite2 star30)
   goals met: 16 of 29
38. (turn_to satellite2 star51 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star51)
   goals met: 15 of 29
39. (take_image satellite2 star51 instrument8 thermograph4)
   added: (have_image star51 thermograph4)
   goals met: 16 of 29
40. (turn_to satellite2 star30 star51)
   deleted: (pointing satellite2 star51)
   added: (pointing satellite2 star30)
   goals met: 17 of 29
41. (turn_to satellite2 star55 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star55)
   goals met: 16 of 29
42. (take_image satellite2 star55 instrument8 thermograph0)
   added: (have_image star55 thermograph0)
   goals met: 17 of 29
43. (turn_to satellite2 star30 star55)
   deleted: (pointing satellite2 star55)
   added: (pointing satellite2 star30)
   goals met: 18 of 29
44. (turn_to satellite2 star59 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star59)
   goals met: 17 of 29
45. (take_image satellite2 star59 instrument8 thermograph0)
   added: (have_image star59 thermograph0)
   goals met: 18 of 29
46. (turn_to satellite2 star30 star59)
   deleted: (pointing satellite2 star59)
   added: (pointing satellite2 star30)
   goals met: 19 of 29
47. (turn_to satellite2 star64 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star64)
   goals met: 18 of 29
48. (take_image satellite2 star64 instrument8 thermograph4)
   added: (have_image star64 thermograph4)
   goals met: 19 of 29
49. (turn_to satellite2 star30 star64)
   deleted: (pointing satellite2 star64)
   added: (pointing satellite2 star30)
   goals met: 20 of 29
50. (turn_to satellite0 star27 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star27)
   goals met: 19 of 29
51. (calibrate satellite0 instrument3 star27)
   added: (calibrated instrument3)
   goals met: 19 of 29
52. (turn_to satellite0 groundstation7 star27)
   deleted: (pointing satellite0 star27)
   added: (pointing satellite0 groundstation7)
   goals met: 20 of 29
53. (turn_to satellite0 phenomenon62 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon62)
   goals met: 19 of 29
54. (take_image satellite0 phenomenon62 instrument3 thermograph3)
   added: (have_image phenomenon62 thermograph3)
   goals met: 20 of 29
55. (turn_to satellite0 groundstation7 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 groundstation7)
   goals met: 21 of 29
56. (turn_to satellite0 planet41 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet41)
   goals met: 20 of 29
57. (take_image satellite0 planet41 instrument3 thermograph3)
   added: (have_image planet41 thermograph3)
   goals met: 21 of 29
58. (turn_to satellite0 groundstation7 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 groundstation7)
   goals met: 22 of 29
59. (turn_to satellite0 planet44 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet44)
   goals met: 21 of 29
60. (take_image satellite0 planet44 instrument3 thermograph3)
   added: (have_image planet44 thermograph3)
   goals met: 22 of 29
61. (turn_to satellite0 groundstation7 planet44)
   deleted: (pointing satellite0 planet44)
   added: (pointing satellite0 groundstation7)
   goals met: 23 of 29
62. (turn_to satellite0 planet47 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet47)
   goals met: 22 of 29
63. (take_image satellite0 planet47 instrument3 thermograph3)
   added: (have_image planet47 thermograph3)
   goals met: 23 of 29
64. (turn_to satellite0 groundstation7 planet47)
   deleted: (pointing satellite0 planet47)
   added: (pointing satellite0 groundstation7)
   goals met: 24 of 29
65. (turn_to satellite0 planet54 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet54)
   goals met: 23 of 29
66. (take_image satellite0 planet54 instrument3 thermograph3)
   added: (have_image planet54 thermograph3)
   goals met: 24 of 29
67. (turn_to satellite0 groundstation7 planet54)
   deleted: (pointing satellite0 planet54)
   added: (pointing satellite0 groundstation7)
   goals met: 25 of 29
68. (turn_to satellite0 planet63 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet63)
   goals met: 24 of 29
69. (take_image satellite0 planet63 instrument3 thermograph3)
   added: (have_image planet63 thermograph3)
   goals met: 25 of 29
70. (turn_to satellite0 groundstation7 planet63)
   deleted: (pointing satellite0 planet63)
   added: (pointing satellite0 groundstation7)
   goals met: 26 of 29
71. (turn_to satellite0 star50 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star50)
   goals met: 25 of 29
72. (take_image satellite0 star50 instrument3 thermograph3)
   added: (have_image star50 thermograph3)
   goals met: 26 of 29
73. (turn_to satellite0 groundstation7 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 groundstation7)
   goals met: 27 of 29
74. (turn_to satellite0 star56 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star56)
   goals met: 26 of 29
75. (take_image satellite0 star56 instrument3 thermograph3)
   added: (have_image star56 thermograph3)
   goals met: 27 of 29
76. (turn_to satellite0 groundstation7 star56)
   deleted: (pointing satellite0 star56)
   added: (pointing satellite0 groundstation7)
   goals met: 28 of 29
77. (turn_to satellite0 star57 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star57)
   goals met: 27 of 29
78. (take_image satellite0 star57 instrument3 thermograph3)
   added: (have_image star57 thermograph3)
   goals met: 28 of 29
79. (turn_to satellite0 groundstation7 star57)
   deleted: (pointing satellite0 star57)
   added: (pointing satellite0 groundstation7)
   goals met: 29 of 29
